## 3) What to do with NaN?

in the sample everything might be ok, but we should prepare fot NaN case

In [40]:
b.isnull().sum()

arr_port    0
pax         0
year        0
dtype: int64

In [41]:
b.count()

arr_port    1000
pax         1000
year        1000
dtype: int64

In [42]:
b=b.dropna()

### What does df.dropna() do?

In [53]:
#np.random.randn
#univariate “normal” (Gaussian) distribution of mean 0 and variance 1
import numpy as np
data=np.random.randn(5, 2)
#print data
#print type(data[0])
#print type(data[0][0])
df = pd.DataFrame(data,columns=['one', 'two' ])
df

        one       two
0 -0.980458  0.432574
1 -0.256838 -0.384186
2 -0.259729 -1.109760
3 -0.507126  0.001813
4 -1.310807  0.706930

In [57]:
df['three']=[None, None, 1, 1, None]
df

        one       two  three
0 -0.980458  0.432574    NaN
1 -0.256838 -0.384186    NaN
2 -0.259729 -1.109760    1.0
3 -0.507126  0.001813    1.0
4 -1.310807  0.706930    NaN

In [58]:
df.dropna()

        one       two  three
2 -0.259729 -1.109760    1.0
3 -0.507126  0.001813    1.0

In [59]:
df

        one       two  three
0 -0.980458  0.432574    NaN
1 -0.256838 -0.384186    NaN
2 -0.259729 -1.109760    1.0
3 -0.507126  0.001813    1.0
4 -1.310807  0.706930    NaN

In [60]:
df.dropna(how='all')

        one       two  three
0 -0.980458  0.432574    NaN
1 -0.256838 -0.384186    NaN
2 -0.259729 -1.109760    1.0
3 -0.507126  0.001813    1.0
4 -1.310807  0.706930    NaN

In [66]:
df["one"][0]="NaN"
df["two"][0]="NaN"
df.dropna(how='all')

        one       two  three
1 -0.256838 -0.384186    NaN
2 -0.259729 -1.109760    1.0
3 -0.507126  0.001813    1.0
4 -1.310807  0.706930    NaN

In [74]:
print df
df.dropna(how='any',axis=0)

        one       two  three
0       NaN       NaN    NaN
1 -0.256838 -0.384186    NaN
2 -0.259729 -1.109760    1.0
3 -0.507126  0.001813    1.0
4 -1.310807  0.706930    NaN

        one       two  three
2 -0.259729 -1.109760    1.0
3 -0.507126  0.001813    1.0

In [75]:
print df
df.dropna(how='any',axis=1)

        one       two  three
0       NaN       NaN    NaN
1 -0.256838 -0.384186    NaN
2 -0.259729 -1.109760    1.0
3 -0.507126  0.001813    1.0
4 -1.310807  0.706930    NaN

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4]

In [72]:
df.dropna()

        one       two  three
2 -0.259729 -1.109760    1.0
3 -0.507126  0.001813    1.0

#### What if we want to drop just based on second column NaN?

In [79]:
df

        one       two  three
0       NaN       NaN    NaN
1 -0.256838 -0.384186    NaN
2 -0.259729 -1.109760    1.0
3 -0.507126  0.001813    1.0
4 -1.310807  0.706930    NaN

In [93]:
df[[True, False, True, True, True]]
#all rows have to have its corresponding true/False

        one       two  three
0       NaN       NaN    NaN
2 -0.259729 -1.109760    1.0
3 -0.507126  0.001813    1.0
4 -1.310807  0.706930    NaN

In [94]:
df['two'].isnull()

0     True
1    False
2    False
3    False
4    False
Name: two, dtype: bool

In [95]:
~df['two'].isnull()

0    False
1     True
2     True
3     True
4     True
Name: two, dtype: bool

In [96]:
df[~(df['two'].isnull())]

        one       two  three
1 -0.256838 -0.384186    NaN
2 -0.259729 -1.109760    1.0
3 -0.507126  0.001813    1.0
4 -1.310807  0.706930    NaN